{
  "backend/main.mo": "Main backend actor implementing user profiles, environmental laws/treaties, interactive timelines, law proposals with voting, and access control using mixins for authorization and blob storage.",
  "feature_evidence.json": "Feature evidence report documenting clickable navigation links for interactive activities in Unit 1-9 pages, table of contents additions, and STEM career resource hyperlinks with associated test IDs and confidence levels.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files describing unit pages with interactive activities, navigation, quizzes, and shared components like sliders, buttons, and STEM career sections.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like backgrounds, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point for the Environmental Systems Learning Platform React application with root div and module script reference.",
  "frontend/src/App.tsx": "Main React app component configuring TanStack Router with routes for all 9 units, progress dashboard, teacher dashboard, wrapped in ThemeProvider and AppLayout with Toaster notifications.",
  "frontend/src/components/dashboard/ProgressDashboard.tsx": "Student progress dashboard displaying completed units, quiz scores, badges earned, and overall progress percentage with login gate and unit-by-unit status cards.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper component providing consistent structure with Navigation header, main content area, and Footer across all pages.",
  "frontend/src/components/layout/Footer.tsx": "Footer component displaying copyright year, attribution to caffeine.ai with dynamic UTM tracking based on hostname.",
  "frontend/src/components/layout/Navigation.tsx": "Navigation component with responsive mobile/desktop menus, Internet Identity authentication, and conditional admin dashboard link. Includes sticky header with logo, nav links, and login/logout button.",
  "frontend/src/components/shared/CareerExploration.tsx": "Displays STEM career cards in a grid layout with career title, description, education requirements, and typical tasks. Features a header with background image and gradient overlay.",
  "frontend/src/components/shared/FunFacts.tsx": "Renders fun facts in a responsive grid of styled cards with decorative leaf accents and gradient backgrounds.",
  "frontend/src/components/shared/GoogleFormEmbed.tsx": "Embeds a Google Form iframe for assessments with a styled header and description.",
  "frontend/src/components/shared/ReadingContent.tsx": "Displays educational reading content organized by subtopics with formatted paragraphs in styled cards.",
  "frontend/src/components/shared/SelfCheckingQuiz.tsx": "Interactive quiz component with multiple-choice questions, instant feedback, score calculation, and integration with user profile to save scores and award badges for 80%+ performance.",
  "frontend/src/components/shared/STEMConnectionsSection.tsx": "Collapsible section featuring external STEM resources (museums, universities, organizations), career pathway information, and a reflection textarea with local storage save functionality.",
  "frontend/src/components/shared/UnitLayout.tsx": "Layout wrapper for unit pages with gradient header, unit number badge, title, and back navigation button.",
  "frontend/src/components/shared/VideoEmbed.tsx": "Displays embedded videos in a responsive grid with titles and descriptions for each video resource.",
  "frontend/src/components/shared/WebQuest.tsx": "Presents structured web-based learning activities with objectives, tasks, and suggested resource links in a styled card layout.",
  "frontend/src/components/unit1/BiogeochemicalCycles.tsx": "Interactive component displaying four biogeochemical cycles (water, carbon, nitrogen, phosphorus) with selectable tabs showing stages and animated visualizations for each cycle.",
  "frontend/src/components/unit1/BioticAbioticSorting.tsx": "Drag-and-sort activity where users categorize 10 items as biotic or abiotic, with immediate feedback, scoring, and reset functionality.",
  "frontend/src/components/unit1/FoodWebBuilder.tsx": "Placeholder component for an interactive food web builder showing organism labels (Sun, Grass, Rabbit, Fox, Hawk, Decomposers) with coming-soon message.",
  "frontend/src/components/unit1/VirtualLab.tsx": "Virtual water quality testing lab with sliders to adjust dissolved oxygen and nitrate levels, providing real-time quality assessments and analysis.",
  "frontend/src/data/unitCareers.ts": "Data file defining career information (title, description, education, tasks) for environmental science professions organized by units 1-5.",
  "frontend/src/data/unitFormUrls.ts": "Maps unit identifiers to Google Forms URLs for unit tests across all nine environmental science units.",
  "frontend/src/data/unitFunFacts.ts": "Collection of interesting environmental science facts organized by unit, covering topics from rainforest oxygen production to international environmental agreements.",
  "frontend/src/data/unitQuizzes.ts": "Quiz data structure for unit 1 containing multiple-choice questions with options, correct answers, and explanations covering ecosystem concepts and biogeochemical cycles.",
  "frontend/src/data/unitReadingContent.ts": "Exports educational reading content for environmental science units covering topics like environmental systems, biotic/abiotic factors, biogeochemical cycles, biodiversity, scientific method, and models.",
  "frontend/src/data/unitVideos.ts": "Exports YouTube video embeds organized by unit (1-9) covering environmental science topics like ecosystems, scientific method, energy flow, population ecology, succession, pollution, sustainability, economics, and policy.",
  "frontend/src/data/unitWebQuests.ts": "Exports structured web quest activities for each unit with objectives, tasks, questions, and external resource links for students to explore environmental topics through guided online research.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance with authentication, creating anonymous or authenticated actors based on Internet Identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating environmental data including user profiles, laws, treaties, timelines, comparisons, and proposals with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with nature-inspired color palette (forest greens, sage, moss), custom utilities for earth textures and gradients, and animation keyframes for UI effects.",
  "frontend/src/lib/utils.ts": "Utility function that combines clsx and tailwind-merge to merge Tailwind CSS class names intelligently, handling conflicts and conditional classes.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/HomePage.tsx": "Landing page displaying 9 environmental science units as interactive cards with hero section, unit navigation, and gradient backgrounds.",
  "frontend/src/pages/TeacherDashboard.tsx": "Admin-only dashboard showing student statistics (total students, badges earned, average completion) and a table of student progress requiring Internet Identity authentication.",
  "frontend/src/pages/Unit1EnvironmentalSystems.tsx": "Unit 1 page with reading content, videos, web quests, and interactive activities including biotic/abiotic sorting, food web builder, virtual lab, and biogeochemical cycles.",
  "frontend/src/pages/Unit2NatureOfScience.tsx": "Unit 2 page covering scientific method with reading content, videos, web quests, and placeholder interactive activities for scientific method builder and hypothesis testing.",
  "frontend/src/pages/Unit3EnergyFlow.tsx": "Unit 3 page about energy flow in environmental systems with reading content, videos, web quests, and placeholder interactive activities for energy pyramid builder and trophic level simulator.",
  "frontend/src/pages/Unit4CarryingCapacity.tsx": "Unit 4 page component covering carrying capacity concepts with placeholder interactive activities for population growth simulation and limiting factors analysis. Includes reading content, videos, web quests, fun facts, careers, STEM connections, and a self-checking quiz.",
  "frontend/src/pages/Unit5NaturalChange.tsx": "Unit 5 page component on natural environmental change with placeholder activities for succession timelines and disturbance simulation. Follows the same structure as Unit 4 with reading content, videos, web quests, fun facts, careers, STEM connections, and quiz.",
  "frontend/src/pages/Unit6HumanImpact.tsx": "Unit 6 page component focused on human impact through emissions and pollutants with placeholder activities for pollution tracking and carbon footprint calculation. Uses the standard unit layout with all educational components.",
  "frontend/src/pages/Unit7HumanActions.tsx": "Unit 7 page component covering individual and collective human actions with placeholder activities for sustainability audits and renewable energy comparison. Includes all standard unit educational components.",
  "frontend/src/pages/Unit8EthicsEconomics.tsx": "Unit 8 page component on ethics and economic priorities with placeholder activities for cost-benefit analysis and ethical dilemma cases. Follows the standard unit structure with all educational sections.",
  "frontend/src/pages/Unit9Legislation.tsx": "Unit 9 page component covering environmental legislation with placeholder activities for policy timelines, treaty comparison, and law proposal simulation. Includes all standard unit components with reading, videos, quests, facts, careers, and quiz.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support and methods to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a nature-inspired design system with custom colors (forest green, sage, olive, moss, brown, tan), OKLCH color space, custom shadows, animations, and typography/container plugins.",
  "project_state.json": "Project metadata defining an interactive Environmental Systems learning website with 9 curriculum units for high school students, featuring React architecture, nature-inspired design, virtual labs, progress tracking, and teacher dashboard."
}